#+TITLE:     Servidor REST em Common Lisp
#+LANGUAGE:  pt_BR
#+AUTHOR:    Lucas S. Vieira
#+EMAIL:     lucasvieira@protonmail.com
#+STARTUP:   inlineimages content latexpreview shrink
#+PROPERTY:  header-args:lisp :noweb strip-export :eval no :tangle no :results silent
#+OPTIONS:   toc:nil title:nil

:LATEX_PROPERTIES:
# Evaluate this block to use a book which starts with chapters instead
# of parts.

#+NAME: setclass
#+begin_src emacs-lisp :tangle no :eval yes :results silent :exports none
(add-to-list 'org-latex-classes
             '("book-noparts"
               "\\documentclass{memoir}"
               ("\\chapter{%s}" . "\\chapter*{%s}")
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

(setq org-latex-listings 'minted)

nil ;; prevent output
#+end_src

#+CALL: setclass()

# Preamble
# #+LATEX_CLASS: article

#+LATEX_CLASS: book-noparts
#+LATEX_CLASS_OPTIONS: [openright,a4paper,twoside,11pt]

#+LATEX_HEADER: \usepackage[brazil]{babel}
#+LATEX_HEADER: \usepackage{times}
# #+LATEX_HEADER: \usepackage[utf8x]{inputenc}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{microtype}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage[english, hyperpageref]{backref}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \usepackage[alf,abnt-emphasize=bf,abnt-doi=link]{abntex2cite}
#+LATEX_HEADER: \usepackage{indentfirst}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{geometry}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \usepackage{titling}

# #+LATEX_HEADER: \usepackage{draftwatermark}

*** Definição do pacote de utilitários

Este  pacote de  utilitários possui  funções e  macros auxiliares  que
podem ser usados globalmente.

#+begin_src lisp
(defpackage #:rest-server.util
  (:nicknames #:util)
  (:use #:cl #:cl-arrows)
  (:export #:agetf
           #:route-prepare-response
           #:http-response
           #:symbol->keyword
           #:class-table-p
           #:table-get-lispy-columns
           #:table-get-lispy-register-columns
           #:table-get-string-columns
           #:table-get-string-register-columns
           #:get-payload
           #:post-valid-data-p
           #:dao->alist
           #:filter-alist
           #:dao->filtered-alist
           #:dao->json)
  (:documentation
   "Utilities and miscellaneous structures for
all other project modules."))
#+end_src

#+RESULTS:
: #<PACKAGE "REST-SERVER.UTIL">

*** Definição do pacote principal

Este pacote  engloba as  operações principais  da aplicação,  como seu
ponto de entrada para que a  aplicação seja iniciada ou encerrada, bem
como suas /rotas/.

#+begin_src lisp
(defpackage #:rest-server
  (:nicknames #:restmain)
  (:use #:cl #:cl-arrows #:ningle)
  (:export #:start-server
           #:stop-server)
  (:documentation
   "Default package for the application, containing
routes and routines for starting/stopping the web
server."))
#+end_src

#+RESULTS:
: #<PACKAGE "REST-SERVER">

** Listagem de usuários

Ningle  possibilita  que  criemos  uma definição  de  rota  para  cada
caso. Primeiramente, definimos uma rota para requisição =GET= em =/users=,
que retorna todos os usuários cadastrados.

#+begin_src lisp
(setf (route *app* "/users" :method :GET)
      (lambda (params)
        (declare (ignore params))
        (db:control-index :user)))
#+end_src

Finalmente,  estabelecemos   uma  rota   para  a  requisição   =GET=  em
~/users/:id~, onde  ~:id~ representa  um parâmetro  esperado na  rota, que
estará na variável ~params~.

Caso a  ID do usuário em  questão seja inválida, retornamos  um objeto
JSON com  um único  campo de  mensagem, informando  que aquela  ID não
existe no banco de dados, e sob um código HTTP 404 (não encontrado).


#+begin_src lisp
(setf (route *app* "/users/:id" :method :GET)
      (lambda (params)
        (db:control-show :user params)))
#+end_src

#+RESULTS:
: #<FUNCTION (LAMBDA (PARAMS)) {53352AEB}>

** Registrar usuário

Abaixo,  definimos a  rota  para  registro do  usuário.  Veja que  não
tratamos  as  regras  de  negócio  aqui;  estas  ficarão  a  cargo  do
controlador do usuário.

#+begin_src lisp
(setf (route *app* "/users" :method :POST)
      (lambda (params)
        (declare (ignore params))
        (db:control-store :user)))
#+end_src

#+RESULTS:
: #<FUNCTION (LAMBDA (PARAMS)) {5335B62B}>

**** Verificando o SQL gerado a cada consulta

Para  imprimir  o SQL  de  cada  consulta  no  REPL, use  o  parâmetro
~mito:*mito-logger-stream*~. Por exemplo:

#+begin_src lisp :tangle no :results output :exports both :eval no
(setf mito:*mito-logger-stream* t)
(mito:find-dao 'user :mail "fulano@exemplo.com")
#+end_src

#+RESULTS:
: ;; SELECT * FROM "user" WHERE ("mail" = $1) LIMIT 1 ("fulano@exemplo.com") [1 row] (2ms) | SWANK::CALL-WITH-RETRY-RESTART

Para voltar ao normal:

#+begin_src lisp :tangle no :eval no
(setf mito:*mito-logger-stream* nil)
#+end_src

#+RESULTS:
: NIL

*** Executando as migrações pelo console

Antes de  gerarmos as tabelas  de fato,  podemos executar o  ~mito~ pelo
console  para que  este gere  arquivos  ~.sql~ das  migrações, com  seus
respectivos timestamps.

Esta opção  é muito útil  caso você  queira garantir que  suas tabelas
sejam versionadas,  e que  o versionamento seja  feito em  seu próprio
arquivo de código SQL.

Para tanto:

1. Navegue até a pasta raiz do projeto;
2. Crie um  diretório chamado ~mito~. Usaremos  este diretório para
   armazenar todos os arquivos ~.sql~ criados pelo ~mito~ no console.

#+begin_src bash :eval no :tangle no
cd /path/to/rest-server-example
mkdir mito
#+end_src

Finalmente,  execute  o comando  a  seguir.  Veja  que ele  utiliza  a
instalação  do  Quicklisp  pelo  Qlot para  criar  as  migrações  como
necessário:

#+begin_src bash :eval no :tangle no
qlot exec mito generate-migrations -t postgres \
     -u postgres -p docker -P 5432 -d cl-rest \
     -s rest-server-example -D ./mito
#+end_src

Destrinchando este comando, temos os seguintes argumentos:

- =-t postgres=: Anuncia que o tipo do  banco de dados a ser utilizado é
  PostgreSQL;
- =-u postgres=:  Anuncia o  nome do  usuário do  banco de  dados. Neste
  caso, sendo ~postgres~;
- =-p docker= Anuncia a senha de acesso do usuário;
- =-P 5432=: Anuncia a porta na qual o banco de dados está operando;
- =-d cl-rest=: Anuncia o nome do banco de dados (~cl-rest~);
- =-D ./mito=: Anuncia o diretório onde as migrações serão armazenadas.

Lembremos sempre que informações sensíveis (usuário e senha do banco
de dados, por  exemplo) são melhor armazenados em um  local de difícil
acesso para o público em geral.

O argumento =-s rest-server-example= deixa  bem claro que vamos carregar
o /system/ do  projeto atual (homônimo ao informado).  Dessa forma, ~mito~
varre  todos  os  pacotes  do  sistema,  em  busca  de  definições  de
tabelas. Ao encontrá-las, ele gera os arquivos SQL necessários para as
mesmas.

Por  conveniência, à  medida  que  o projeto  evoluir,  vou manter  as
migrações geradas neste repositório, constatando as mudanças que foram
efetuadas.

Para avaliar o estado das migrações em questão, podemos usar novamente
o ~mito~, desta vez sem necessidade do respaldo do Qlot:

#+begin_src bash :tangle no :cache yes :exports both :results verbatim :eval no
mito migration-status -t postgres \
     -u postgres -p docker -P 5432 -d cl-rest \
     -D ./mito
#+end_src

#+RESULTS[794b2433a8feb8a1e024e55a54c1bd83190f1140]:
: 
:  Status   Migration ID
: --------------------------
:   down    20200416161815

Agora, podemos finalmente migrar o banco de dados:

#+begin_src bash :tangle no :cache yes :exports both :results verbatim
mito migrate -t postgres \
     -u postgres -p docker -P 5432 -d cl-rest \
     -D ./mito
#+end_src

#+RESULTS[9e53747730c5174881ffd71a0eacf860447b3fba]:
#+begin_example

Applying './mito/schema.sql'...
-> CREATE TABLE "user" (
    "id" BIGSERIAL NOT NULL PRIMARY KEY,
    "name" VARCHAR(80) NOT NULL,
    "birthdate" TIMESTAMPTZ NOT NULL,
    "address" VARCHAR(255) NOT NULL,
    "mail" VARCHAR(64) NOT NULL,
    "pass" VARCHAR(64) NOT NULL,
    "created_at" TIMESTAMPTZ,
    "updated_at" TIMESTAMPTZ
);
-> CREATE UNIQUE INDEX "unique_user_mail" ON "user" ("mail");
-> CREATE TABLE IF NOT EXISTS "schema_migrations" (
    "version" VARCHAR(255) PRIMARY KEY,
    "applied_at" TIMESTAMPTZ DEFAULT CURRENT_TIMESTAMP
);
Successfully updated to the version "20200416161815".
#+end_example

*** Usuário
:PROPERTIES:
:header-args:lisp: :tangle src/models/user.lisp
:END:

#+begin_src lisp
(in-package #:rest-server.db)
#+end_src

Aqui definimos  os campos para  um usuário  do sistema.  Os  campos da
tabela do usuário estão listados a seguir:

|---------------+-------------+----------------------------|
| Nome          | Tipo        | Observações                |
|---------------+-------------+----------------------------|
| id            | BIGSERIAL   | Automático, chave primária |
| name          | VARCHAR 80  |                            |
| birthdate     | TIMESTAMPTZ |                            |
| address       | VARCHAR 255 |                            |
| mail          | VARCHAR 64  | Índice único               |
| password_hash | CHAR 64     | Automático (mito-auth)     |
| password_salt | BINARY 20   | Automático (mito-auth)     |
| created_at    | TIMESTAMPTZ | Automático                 |
| updated_at    | TIMESTAMPTZ | Automático                 |
|---------------+-------------+----------------------------|

#+begin_src lisp
(deftable user (has-secure-password)
  ((name :col-type (:varchar 80)
         :initarg :name
         :accessor user-name)
   (birthdate :col-type :timestamptz
              :initarg :birthdate
              :accessor user-birthdate)
   (address :col-type (:varchar 255)
            :initarg :address
            :accessor user-address)
   (mail :col-type (:varchar 64)
         :initarg :mail
         :accessor user-mail))
  (:unique-keys mail)
  (:documentation
   "Represents the `user` table on database."))
#+end_src

#+RESULTS:
: #<DAO-TABLE-CLASS REST-SERVER.DB:USER>

É interessante  lembrar que  uma tabela  do ~mito~ nada  mais é  que uma
classe, cujo campo ~:metaclass~ equivale a ~mito:dao-table-class~.

**** Verificação do Index

#+begin_src lisp
(defmethod control-index :around (type &optional params)
  (declare (ignore type params))
  (if (->> ningle:*request*
              lack.request:request-headers
              (gethash "authorization")
              request-authorized-p
              not)
      (util:http-response (401)
        "Authentication token is invalid.")
      (call-next-method)))
#+end_src

#+RESULTS:
: #<STANDARD-METHOD REST-SERVER.DB:CONTROL-INDEX :AROUND (T) {1001CB9EE3}>

**** Verificação do Show

#+begin_src lisp
(defmethod control-show :around (type &optional params)
  (declare (ignore type params))
  (if (->> ningle:*request*
              lack.request:request-headers
              (gethash "authorization")
              request-authorized-p
              not)
      (util:http-response (401)
        "Authentication token is invalid.")
      (call-next-method)))
#+end_src

#+RESULTS:
: #<STANDARD-METHOD REST-SERVER.DB:CONTROL-SHOW :AROUND (T) {100367EA83}>

**** Verificação do Store

#+begin_src lisp
(defmethod control-store :around (type &optional params)
  (declare (ignore params))
  (cond ((eql type :session)
         (call-next-method))
        ((->> ningle:*request*
              lack.request:request-headers
              (gethash "authorization")
              request-authorized-p
              not)
         (util:http-response (401)
           "Authentication token is invalid."))
        (t (call-next-method))))
#+end_src

#+RESULTS:
: #<STANDARD-METHOD REST-SERVER.DB:CONTROL-STORE :AROUND (T) {10054843A3}>

*** Index

O  método /index/  é capaz  de  mostrar todos  os usuários  do banco  de
dados. Estes usuários são retornados na  forma de um vetor de objetos,
em notação JSON.

# TODO: Exigir ou permitir paginação

#+begin_src lisp
(defmethod control-index ((type (eql :user)) &optional params)
  (declare (ignore params))
  (->> (mito:select-dao 'db:user)
       (mapcar #'util:dao->filtered-alist)
       json:encode-json-to-string))
#+end_src

#+RESULTS:
: #<STANDARD-METHOD REST-SERVER.DB:CONTROL-INDEX ((EQL :USER) T T) {10070E5043}>

*** Store

O método /store/ cadastra um novo usuário no banco de dados.

O  corpo da  requisição espera  pelos campos  necessários para  que um
usuário seja registrado no sistema.

Estes campos são automaticamente deduzidos a partir da classe ~db:user~,
que representa  a tabela ~user~, e  portanto podem mudar sem  prejuízo à
verificação dos campos necessários.

Este  método  pode retornar  códigos  HTTP  ~400~  caso os  dados  sejam
insuficientes,  ou caso  o usuário  já exista  no banco  de dados.  Do
contrário, é  retornada uma  mensagem de sucesso  em JSON,  cujo campo
~"message"~ contém a string ~"OK"~.

#+begin_src lisp
(defmethod control-store ((type (eql :user)) &optional params)
  (declare (ignore params))
  (let ((payload (util:get-payload ningle:*request*)))
    (if (not (util:post-valid-data-p 'db:user payload
                                     :has-password t))
        (util:http-response (400)
          "Malformed user data")
        (handler-case
            (macrolet ((get-field (field)
                         `(util:agetf ,field payload)))
              (mito:create-dao
               'user
               :name (get-field :name)
               :birthdate (get-field :birthdate)
               :address (get-field :address)
               :mail (get-field :mail)
               :password (get-field :password))
              (util:http-response ())) ; 200 OK
          (dbi.error:dbi-database-error (e)
            (declare (ignore e))
            (util:http-response (400)
              "User already exists"))))))
#+end_src

#+RESULTS:
: #<STANDARD-METHOD REST-SERVER.DB:CONTROL-STORE ((EQL :USER)) {1002B675C3}>

*** Store

O método /store/ cria uma nova sessão para um usuário informado no corpo
da requisição.

O  corpo  deverá  informar  os   elementos  ~mail~  e  ~password~  para  o
usuário. Caso estes elementos não sejam informados, será retornada uma
resposta  HTTP 400,  dizendo que  as  informações de  login não  estão
completas.

Caso o usuário  não possa ser encontrado por seu  ~mail~, será retornada
uma  nova  resposta  HTTP  404,  informando  que  o  usuário  não  foi
encontrado ou não existe.

# TODO: Gerar token JWT e documentar o retorno

#+begin_src lisp
(defmethod control-store ((type (eql :session)) &optional params)
  (declare (ignore params))
  (let* ((payload (util:get-payload ningle:*request*))
         (mail (util:agetf :mail payload))
         (pass (util:agetf :password payload)))
    (if (or (null mail) (null pass))
        (util:http-response (400)
          "Malformed login data")
        (let* ((dao (mito:find-dao 'db:user :mail mail))
               (alist (if dao (util:dao->alist dao) nil)))
          (cond ((null dao)
                 (util:http-response (404)
                   "Unknown user"))
                ((mito-auth:auth dao pass)
                 (util:http-response ()
                   (gen-session-data
                     `(("id" . ,(util:agetf :id alist))
                       ("mail" . ,mail)))))
                (t (util:http-response (403)
                     "Wrong password")))))))
#+end_src

#+RESULTS:
: #<STANDARD-METHOD REST-SERVER.DB:CONTROL-STORE ((EQL :SESSION)) {1008DE9523}>

** Convertendo símbolos para keywords

Esta função converte um certo  símbolo genérico para uma /keyword/. Esta
operação  é  muito  útil  quando  estamos  tratando  de  símbolos  que
pertencem  a outros  pacotes, pois  /keywords/ sempre  pertencem ao  seu
próprio pacote.

#+begin_src lisp
(defun symbol->keyword (symbol)
  "Transforms a specific SYMBOL into a keyword."
  (unless (symbolp symbol)
    (error "~a is not of type SYMBOL" symbol))
  (intern (format nil "~a" symbol) :keyword))
#+end_src

#+RESULTS:
: SYMBOL->KEYWORD

** Convertendo strings para keywords

Esta função é similar à anterior, porém converte uma certa string para
uma keyword.  Esta operação é  útil na formatação do  payload recebido
via requisição POST, mas não é usado diretamente.

#+begin_src lisp
(defun string->keyword (string)
    "Transforms a specific STRING into a keyword.
The string is trimmed and transformed to uppercase."
  (unless (stringp string)
    (error "~a is not of type STRING" string))
  (intern (->> string
               (string-trim '(#\Space #\Return))
               string-upcase)
          :keyword))
#+end_src

#+RESULTS:
: STRING->KEYWORD

** Obtendo campos de um DAO

A função  a seguir  toma um  objeto instanciado a  partir de  dados do
banco de dados,  verifica sua classe correspondente, e  cria uma /alist/
com dados  correspondentes a  suas colunas. Note  que esta  função não
filtra informações potencialmente sensíveis.

#+begin_src lisp
(defun dao->alist (dao)
  "Takes an entity DAO and turns it into an alist.

DAO must be a valid entity.

The returned alist is a list of CONS pairs, where
CAR is a keyword identifier for a field, and CDR
is the value itself."
  (let ((class (type-of dao)))
    (loop for field in (util:table-get-lispy-columns class)
       for getter-sym =
         (case field
           (:id 'mito:object-id)
           (:created-at    'mito:object-created-at)
           (:updated-at    'mito:object-updated-at)
           (:password-hash 'mito-auth:password-hash)
           (:password-salt 'mito-auth:password-salt)
           (otherwise
            (intern (string-upcase
                     (concatenate 'string
                                  (format nil "~a" class)
                                  "-"
                                  (format nil "~a" field)))
                    :rest-server.db)))
       collect (cons field (funcall getter-sym dao)))))
#+end_src

#+RESULTS:
: DAO->ALIST

